<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CandidateSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('candidates')->insert([
            [
                'text' => '<h3><strong>Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվելու համար որակավորման ստուգմանը մասնակցելու համար ներկայացվող պահանջները.</strong>&nbsp;</h3>

                <p>&nbsp;</p>
                
                <p>Որակավորման ստուգմանը կարող են մասնակցել 25-ից 60 տարեկան, ընտրական իրավունք ունեցող անձինք, եթե՝</p>
                
                <p>&nbsp;</p>
                
                <ul>
                    <li><strong>1.</strong> ունեն միայն Հայաստանի Հանրապետության քաղաքացիություն.</li>
                    <li><strong>2.</strong> Հայաստանի Հանրապետությունում ստացել են իրավագիտության բակալավրի և իրավագիտության մագիստրոսի որակավորման աստիճան կամ դիպլոմավորված մասնագետի բարձրագույն իրավաբանական կրթության որակավորման աստիճան կամ համապատասխան աստիճան են ձեռք բերել օտարերկրյա պետությունում, որոնց ճանաչումն ու համարժեքության հաստատումը Հայաստանի Հանրապետությունում իրականացվել են օրենքով սահմանված կարգով.</li>
                    <li><strong>3.</strong> տիրապետում են հայերենին.</li>
                    <li><strong>4.</strong> ունեն անգլերեն, գերմաներեն, ռուսերեն և ֆրանսերեն լեզուներից առնվազն մեկի` ստանդարտացված թեստային համակարգերով ստուգվող լեզվական գիտելիքների` Բարձրագույն դատական խորհրդի սահմանած համապատասխան մակարդակի իմացություն.</li>
                    <li><strong>5.</strong> ունեն առնվազն երեք տարվա մասնագիտական աշխատանքի փորձառություն.</li>
                    <li><strong>6.</strong> առկա չեն դատավոր նշանակվելու ներքոնշյալ սահմանափակումները՝<br />
                    &nbsp;
                    <ul>
                        <li><strong>1.</strong> դատապարտվել է հանցագործության համար, և դատվածությունը մարված կամ հանված չէ.</li>
                        <li><strong>2.</strong> դատապարտվել է դիտավորյալ հանցագործության համար կամ ազատությունից զրկելու հետ կապված պատիժ է կրել` անկախ դատվածությունը մարված կամ հանված լինելու հանգամանքից.</li>
                        <li><strong>3.</strong> ունի դատավորի պաշտոնում նշանակվելուն խոչընդոտող ֆիզիկական արատ կամ հիվանդություն (ցանկը սահմանում է Կառավարությունը).</li>
                        <li><strong>4.</strong> չի անցել պարտադիր զինվորական ծառայություն կամ այլընտրանքային ծառայություն կամ օրենքով նախատեսված կարգով չի ազատվել պարտադիր զինվորական ծառայությունից (եթե անձն արական սեռի է).</li>
                        <li><strong>5.</strong> դատարանի՝ օրինական ուժի մեջ մտած վճռով ճանաչված է անգործունակ, սահմանափակ գործունակ, անհայտ բացակայող կամ սնանկ, և սնանկության վարույթը չի ավարտվել.</li>
                        <li><strong>6.</strong> նրա նկատմամբ հարուցված է քրեական հետապնդում:</li>
                    </ul>
                    </li>
                </ul>
                
                <p>&nbsp;</p>
                
                <p>Գիտական աստիճան ունեցող հավակնորդը, բացի վերը նշվածից, պետք է համապատասխանի հետևյալ չափանիշներին՝</p>
                
                <ul>
                    <li><strong>1.</strong> իրավագիտության բնագավառում ունի գիտական աստիճան,</li>
                    <li><strong>2.</strong> վերջին տասը տարիների ընթացքում առնվազն հինգ տարի դասավանդել է իրավունք բարձրագույն ուսումնական հաստատությունում կամ գիտական հաստատությունում կատարել է գիտական աշխատանք:</li>
                </ul>
                
                <p>&nbsp;</p>
                
                <p>Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվելու նպատակով անցկացվում է որակավորման ստուգում: Որակավորման ստուգումը բաղկացած է հետևյալ փուլերից.</p>
                
                <ul>
                    <li><strong>1.</strong> հայտի ներկայացում և ստուգում,</li>
                    <li><strong>2.</strong> գրավոր քննություն,</li>
                    <li><strong>3.</strong> հարցազրույցի անցկացում:</li>
                </ul>
                
                <p>&nbsp;</p>
                
                <p>Ընդ որում, գիտական աստիճան ունեցող հավակնորդները գրավոր քննության փուլին չեն մասնակցում:</p>
                
                <p>&nbsp;</p>
                
                <h3><strong>Հավակնորդի կողմից ներկայացվող փաստաթղթերը.</strong>&nbsp;</h3>
                
                <p>&nbsp;</p>
                
                <ul>
                    <li><strong>1.</strong> Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվել հավակնող անձը (այսուհետ՝ հավակնորդ) որակավորման ստուգման մասին որոշման հրապարակման օրվան հաջորդող օրվանից մեկամսյա ժամկետում որակավորման ստուգմանը մասնակցելու համար Բարձրագույն դատական խորհուրդ է ներկայացնում Բարձրագույն դատական խորհրդի սահմանած ձևի հայտ:</li>
                    <li><strong>2.</strong> Հայտին կից ներկայացվում են`<br />
                    &nbsp;
                    <ul>
                        <li><strong>1.</strong> անձը հաստատող փաստաթղթի, նույնականացման քարտի պատճենները և էլեկտրոնային փոստի հասցեն.</li>
                        <li><strong>2.</strong> հինգ գունավոր լուսանկար.</li>
                        <li><strong>3.</strong> իր կենսագրական տվյալները պարունակող քարտ.</li>
                        <li><strong>4.</strong> նոտարական կարգով հաստատված բանավոր հայտարարություն իր դատվածության և սնանկության կամ դրանց բացակայության մասին.</li>
                        <li><strong>5.</strong> իրավաբանական կրթության՝ պահանջվող որակավորման աստիճանի առկայությունը հավաստող փաստաթուղթ.</li>
                        <li><strong>6.</strong> հայերենին տիրապետելու հանգամանքը հավաստող փաստաթուղթ.</li>
                        <li><strong>7.</strong> պահանջվող օտար լեզուների՝ Բարձրագույն դատական խորհրդի սահմանած համապատասխան մակարդակին տիրապետելու հանգամանքը հավաստող փաստաթուղթ, բացառությամբ սույն հոդվածի 3.1-ին մասով նախատեսված դեպքի.</li>
                        <li><strong>8.</strong> պահանջվող մասնագիտական աշխատանքի փորձառությունը հավաստող ապացույց, այդ թվում՝ աշխատանքային պարտականությունները հավաստող պաշտոնի անձնագիր կամ այլ փաստաթղթեր.</li>
                        <li><strong>9.</strong> արական սեռի հավակնորդի դեպքում՝ պարտադիր զինվորական ծառայություն անցած լինելու հանգամանքը հավաստող կամ այլընտրանքային ծառայություն անցած լինելու կամ պարտադիր զինվորական ծառայությունից ազատված լինելու փաստը հավաստող փաստաթուղթ.</li>
                        <li><strong>10.</strong> դատավորի պաշտոնում նշանակմանը խոչընդոտող ֆիզիկական արատների և հիվանդությունների բացակայության մասին Կառավարության սահմանած կարգով տրված փաստաթուղթ.</li>
                        <li><strong>11.</strong> Բարձրագույն դատական խորհրդի սահմանած ձևով համաձայնություն՝ իր վերաբերյալ պետական մարմիններից և պաշտոնատար անձանցից, հավակնորդին ներկայացվող պահանջների համապատասխանության ստուգման սահմաններում, անհրաժեշտ անձնական տվյալներ, այդ թվում` բժշկական գաղտնիք հանդիսացող և այլ տեղեկություններ ստանալու մասին.</li>
                        <li><strong>12.</strong> առավելագույնը երեք երաշխավորագիր-նամակ՝ ըստ հավակնորդի ցանկության.</li>
                        <li><strong>13.</strong> գրավոր հայտարարություն հայտում առկա տեղեկությունների և կից ներկայացված փաստաթղթերի հավաստիության մասին:</li>
                        <li>&nbsp;</li>
                    </ul>
                    </li>
                    <li><strong>3.</strong> Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվել հավակնող անձը (այսուհետ՝ հավակնորդ) որակավորման ստուգման մասին որոշման հրապարակման օրվան հաջորդող օրվանից մեկամսյա ժամկետում որակավորման ստուգմանը մասնակցելու համար Բարձրագույն դատական խորհուրդ է ներկայացնում Բարձրագույն դատական խորհրդի սահմանած ձևի հայտ:</li>
                    <li><strong>4.</strong> Հայերենին տիրապետելու հանգամանքը հավաստվում է ուսումնական հաստատություններում հայերենով կրթություն ստացած կամ կրթական ծրագրերով նախատեսված՝ հայոց լեզու առարկայի ուսումնառությունն ավարտած և ամփոփիչ ատեստավորում անցած լինելու վերաբերյալ ուսումնական հաստատությունների տված ավարտական փաստաթղթով (վկայական, ատեստատ, դիպլոմ): Հայերենին տիրապետելու հանգամանքը հավաստող ավարտական փաստաթղթի բացակայության դեպքում հայերենին տիրապետելու հանգամանքն ստուգվում է կրթության և գիտության ոլորտում Կառավարության քաղաքականությունը մշակող և իրականացնող նախարարի սահմանած կարգով, որը պետք է նախատեսի հայերենին տիրապետելու հանգամանքի ստուգման ողջամիտ, օբյեկտիվ չափորոշիչներ, ինչպես նաև գործընթացի վերահսկողության ընթացակարգեր:</li>
                    <li><strong>5.</strong> ՀՀ դատական օրենսգիրք սահմանադրական օրենքի իմաստով՝ մասնագիտական աշխատանքի փորձառությունը բակալավրի կամ դիպլոմավորված մասնագետի բարձրագույն իրավաբանական կրթության որակավորման աստիճան ձեռք բերելուց հետո իրավունքի ոլորտում իրականացված մասնագիտական գործունեությունն է, եթե այլ բան սահմանված չէ սույն օրենսգրքով:</li>
                    <li><strong>6.</strong> ՀՀ դատական օրենսգիրք սահմանադրական օրենքի 106-րդ հոդվածում, 123-րդ հոդվածի 6-րդ մասի 3-րդ կետում և 132-րդ հոդվածի 2-րդ մասի 3-րդ կետով նախատեսված անձանց համար մասնագիտական աշխատանքի փորձառություն է բարձրագույն ուսումնական հաստատությունում և (կամ) &laquo;Արդարադատության ակադեմիա&raquo; պետական ոչ առևտրային կազմակերպությունում, &laquo;Հայաստանի Հանրապետության փաստաբանական դպրոց&raquo; հիմնադրամում իրավունքի դասավանդումը կամ գիտական հաստատությունում իրավունքի ոլորտում կատարած գիտական աշխատանքը:</li>
                </ul>
                
                <h3>&nbsp;</h3>
                
                <h3><strong>Գրավոր քննություն.</strong>&nbsp;</h3>
                
                <p>&nbsp;</p>
                
                <p>Գրավոր քննությունը կազմակերպում է ԲԴԽ-ն: Քննությունն անցկացվում է համապատասխանաբար քրեական, քաղաքացիական կամ վարչական մասնագիտացման ոլորտում գրավոր առաջադրանքների միջոցով, որոնք, բացի տեսական իրավական գիտելիքների ստուգումից, ուղղված են նաև հավակնորդի վերլուծական և իրավակիրառ կարողությունների ստուգմանը:</p>
                
                <p>Գրավոր քննությանը ներկայացվող պահանջներն ու քննական նյութի բովանդակությանը ներկայացվող պահանջները, ներառյալ անցողիկ միավորները յուրաքանչյուր մինչև սեպտեմբերի 15-ը հաստատում է ԲԴԽ-ը: Ընդ որում, անցողիկը չի կարող պակաս լինել ընդհանուր միավորների 60 տոկոսից:</p>
                
                <p>Գրավոր քննությունից հավասար անցողիկ միավոր ունեցող բոլոր հավակնորդներն ընդգրկվում են ցուցակում և անցնում հաջորդ փուլ:</p>
                
                <h3>&nbsp;</h3>
                
                <h3><strong>Հարցազրույցի անցկացումը.</strong>&nbsp;</h3>
                
                <p>&nbsp;</p>
                
                <p>Հարցազրույցն իրականացվում է համալրված միասնական ցուցակի բոլոր անդամների համար, որում ներառվում են ինչպես գրավոր քննության փուլը հաղթահարած, այնպես էլ գիտական աստիճան ունեցող հավակնորդները:</p>
                
                <h3>&nbsp;</h3>
                
                <h3><strong>Հարցազրույցը կազմված է երկու մասից՝</strong>&nbsp;</h3>
                
                <p>&nbsp;</p>
                
                <p>Առաջին մասը ներառում է յուրաքանչյուր հավակնորդի անձնական գործի և անցած մասնագիտական փորձի ուսումնասիրությունը,</p>
                
                <p>Երկրորդ մասը ներառում է դատավորի վարքագծի կանոններին վերաբերող հիպոթետիկ խնդրի վերլուծություն և դիրքորոշման ներկայացում:</p>
                
                <p>Իրավագիտության բնագավառում գիտական աստիճան ունեցող անձանց համար հարցազրույցը վերը նշվածից բացի ներառում է նաև համապատասխան մասնագիտացման ոլորտում մեկ հակիրճ իրավական հարցի վերաբերյալ հավակնորդի կողմից իրականացվող վերլուծություն ու դիրքորոշման ներկայացում՝ կարճ ժամանակահատվածում հանպատրաստից կողմնորոշվելու, ինքնատիրապետման, վարվեցողության, հաղորդակցման հմտությունները, վերլուծական կարողությունները և դատավորի պաշտոնում արդյունավետ գործելու համար հավակնորդի անհրաժեշտ այլ հմտություններն ու որակները գնահատելու համար:</p>
                
                <p>ԲԴԽ հարցազրույցի արդյունքների ամփոփիչ քննարկման ավարտից հետո անցկացվում է գաղտնի քվեարկություն, որի ընթացքում Բարձրագույն դատական խորհրդի յուրաքանչյուր անդամ իր ներքին համոզմամբ քվեարկում է &laquo;կողմ&raquo; կամ &laquo;դեմ&raquo;: Ընդ որում, յուրաքանչյուր մասնագիտացման բաժնի համար կազմվում են առանձին քվեաթերթիկներ՝ ներառելով հարցազրույցին մասնակցած հավակնորդներին:</p>
                
                <p>Յուրաքանչյուր մասնագիտացման բաժնի համար քվեարկելիս հավակնորդների թիվն անհրաժեշտ քանակին հավասար կամ շատ լինելու դեպքում Բարձրագույն դատական խորհրդի անդամի ունեցած ձայների թիվը հավասար է համալրման համար անհրաժեշտ քանակին, իսկ քիչ լինելու դեպքում՝ հավակնորդների թվին: Եթե քվեարկության մասնակիցն ավելի ձայն է տվել, քան սահմանված է սույն մասով, ապա այդ քվեաթերթիկը համարվում է անվավեր:</p>
                
                <p>Յուրաքանչյուր մասնագիտացման բաժնի համար քվեարկության արդյունքներով Բարձրագույն դատական խորհրդի կողմից կազմվում է դատավորների թեկնածուների հավակնորդների ցուցակ, որում ընդգրկվում են անհրաժեշտ քանակին հավասար քանակի առավելագույն, սակայն ոչ պակաս, քան Բարձրագույն դատական խորհրդի անդամների ընդհանուր թվի ձայների առնվազն կեսից ավելի &laquo;կողմ&raquo; ձայներ ստացած հավակնորդները:</p>
                
                <p>Եթե ձայների հավասարության պատճառով հնարավոր չէ որոշել ընտրված թեկնածուներին, ապա անցկացվում է լրացուցիչ քվեարկություն: Լրացուցիչ քվեարկության արդյունքներով ընտրված են համարվում առավել ձայներ ստացած թեկնածուները: Ձայների հավասարության դեպքում նախապատվությունը տրվում է մասնագիտական աշխատանքի առավել երկար փորձառություն ունեցող թեկնածուին, իսկ փորձառության հավասարության դեպքում՝ տարիքով ավագին:</p>
                
                <p>&nbsp;</p>
                
                <p>Քվեարկության արդյունքում կազմված ցուցակը ԲԴԽ-ն ներկայացնում է Արդարադատության ակադեմիա՝ հավակնորդների ուսուցումը կազմակերպելու նպատակով:</p>
                
                <p>&nbsp;</p>
                
                <p>Գիտական աստիճան ունեցող հավակնորդի համար Արդարադատության ակադեմիայում կազմակերպվում է միայն գործնական հմտությունների զարգացման ուսուցում:</p>
                
                <p>&nbsp;</p>
                
                <p>Ավելի մանրամասն տես՝ ՀՀ դատական օրենսգիրք սահմանադրական օրենքի 95-121-րդ հոդվածները: Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվելու համար որակավորման ստուգմանը մասնակցելու համար հայտերի ներկայացման հետ կապված հարցերով անհրաժեշտ է դիմել ՀՀ բարձրագույն դատական խորհրդի աշխատակազմ:</p>',
            ],


            [
                'text' => '<h3><strong>Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվելու համար որակավորման ստուգմանը մասնակցելու համար ներկայացվող պահանջները.</strong>&nbsp;</h3>

                <p>&nbsp;</p>
                
                <p>Որակավորման ստուգմանը կարող են մասնակցել 25-ից 60 տարեկան, ընտրական իրավունք ունեցող անձինք, եթե՝</p>
                
                <p>&nbsp;</p>
                
                <ul>
                    <li><strong>1.</strong> ունեն միայն Հայաստանի Հանրապետության քաղաքացիություն.</li>
                    <li><strong>2.</strong> Հայաստանի Հանրապետությունում ստացել են իրավագիտության բակալավրի և իրավագիտության մագիստրոսի որակավորման աստիճան կամ դիպլոմավորված մասնագետի բարձրագույն իրավաբանական կրթության որակավորման աստիճան կամ համապատասխան աստիճան են ձեռք բերել օտարերկրյա պետությունում, որոնց ճանաչումն ու համարժեքության հաստատումը Հայաստանի Հանրապետությունում իրականացվել են օրենքով սահմանված կարգով.</li>
                    <li><strong>3.</strong> տիրապետում են հայերենին.</li>
                    <li><strong>4.</strong> ունեն անգլերեն, գերմաներեն, ռուսերեն և ֆրանսերեն լեզուներից առնվազն մեկի` ստանդարտացված թեստային համակարգերով ստուգվող լեզվական գիտելիքների` Բարձրագույն դատական խորհրդի սահմանած համապատասխան մակարդակի իմացություն.</li>
                    <li><strong>5.</strong> ունեն առնվազն երեք տարվա մասնագիտական աշխատանքի փորձառություն.</li>
                    <li><strong>6.</strong> առկա չեն դատավոր նշանակվելու ներքոնշյալ սահմանափակումները՝<br />
                    &nbsp;
                    <ul>
                        <li><strong>1.</strong> դատապարտվել է հանցագործության համար, և դատվածությունը մարված կամ հանված չէ.</li>
                        <li><strong>2.</strong> դատապարտվել է դիտավորյալ հանցագործության համար կամ ազատությունից զրկելու հետ կապված պատիժ է կրել` անկախ դատվածությունը մարված կամ հանված լինելու հանգամանքից.</li>
                        <li><strong>3.</strong> ունի դատավորի պաշտոնում նշանակվելուն խոչընդոտող ֆիզիկական արատ կամ հիվանդություն (ցանկը սահմանում է Կառավարությունը).</li>
                        <li><strong>4.</strong> չի անցել պարտադիր զինվորական ծառայություն կամ այլընտրանքային ծառայություն կամ օրենքով նախատեսված կարգով չի ազատվել պարտադիր զինվորական ծառայությունից (եթե անձն արական սեռի է).</li>
                        <li><strong>5.</strong> դատարանի՝ օրինական ուժի մեջ մտած վճռով ճանաչված է անգործունակ, սահմանափակ գործունակ, անհայտ բացակայող կամ սնանկ, և սնանկության վարույթը չի ավարտվել.</li>
                        <li><strong>6.</strong> նրա նկատմամբ հարուցված է քրեական հետապնդում:</li>
                    </ul>
                    </li>
                </ul>
                
                <p>&nbsp;</p>
                
                <p>Գիտական աստիճան ունեցող հավակնորդը, բացի վերը նշվածից, պետք է համապատասխանի հետևյալ չափանիշներին՝</p>
                
                <ul>
                    <li><strong>1.</strong> իրավագիտության բնագավառում ունի գիտական աստիճան,</li>
                    <li><strong>2.</strong> վերջին տասը տարիների ընթացքում առնվազն հինգ տարի դասավանդել է իրավունք բարձրագույն ուսումնական հաստատությունում կամ գիտական հաստատությունում կատարել է գիտական աշխատանք:</li>
                </ul>
                
                <p>&nbsp;</p>
                
                <p>Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվելու նպատակով անցկացվում է որակավորման ստուգում: Որակավորման ստուգումը բաղկացած է հետևյալ փուլերից.</p>
                
                <ul>
                    <li><strong>1.</strong> հայտի ներկայացում և ստուգում,</li>
                    <li><strong>2.</strong> գրավոր քննություն,</li>
                    <li><strong>3.</strong> հարցազրույցի անցկացում:</li>
                </ul>
                
                <p>&nbsp;</p>
                
                <p>Ընդ որում, գիտական աստիճան ունեցող հավակնորդները գրավոր քննության փուլին չեն մասնակցում:</p>
                
                <p>&nbsp;</p>
                
                <h3><strong>Հավակնորդի կողմից ներկայացվող փաստաթղթերը.</strong>&nbsp;</h3>
                
                <p>&nbsp;</p>
                
                <ul>
                    <li><strong>1.</strong> Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվել հավակնող անձը (այսուհետ՝ հավակնորդ) որակավորման ստուգման մասին որոշման հրապարակման օրվան հաջորդող օրվանից մեկամսյա ժամկետում որակավորման ստուգմանը մասնակցելու համար Բարձրագույն դատական խորհուրդ է ներկայացնում Բարձրագույն դատական խորհրդի սահմանած ձևի հայտ:</li>
                    <li><strong>2.</strong> Հայտին կից ներկայացվում են`<br />
                    &nbsp;
                    <ul>
                        <li><strong>1.</strong> անձը հաստատող փաստաթղթի, նույնականացման քարտի պատճենները և էլեկտրոնային փոստի հասցեն.</li>
                        <li><strong>2.</strong> հինգ գունավոր լուսանկար.</li>
                        <li><strong>3.</strong> իր կենսագրական տվյալները պարունակող քարտ.</li>
                        <li><strong>4.</strong> նոտարական կարգով հաստատված բանավոր հայտարարություն իր դատվածության և սնանկության կամ դրանց բացակայության մասին.</li>
                        <li><strong>5.</strong> իրավաբանական կրթության՝ պահանջվող որակավորման աստիճանի առկայությունը հավաստող փաստաթուղթ.</li>
                        <li><strong>6.</strong> հայերենին տիրապետելու հանգամանքը հավաստող փաստաթուղթ.</li>
                        <li><strong>7.</strong> պահանջվող օտար լեզուների՝ Բարձրագույն դատական խորհրդի սահմանած համապատասխան մակարդակին տիրապետելու հանգամանքը հավաստող փաստաթուղթ, բացառությամբ սույն հոդվածի 3.1-ին մասով նախատեսված դեպքի.</li>
                        <li><strong>8.</strong> պահանջվող մասնագիտական աշխատանքի փորձառությունը հավաստող ապացույց, այդ թվում՝ աշխատանքային պարտականությունները հավաստող պաշտոնի անձնագիր կամ այլ փաստաթղթեր.</li>
                        <li><strong>9.</strong> արական սեռի հավակնորդի դեպքում՝ պարտադիր զինվորական ծառայություն անցած լինելու հանգամանքը հավաստող կամ այլընտրանքային ծառայություն անցած լինելու կամ պարտադիր զինվորական ծառայությունից ազատված լինելու փաստը հավաստող փաստաթուղթ.</li>
                        <li><strong>10.</strong> դատավորի պաշտոնում նշանակմանը խոչընդոտող ֆիզիկական արատների և հիվանդությունների բացակայության մասին Կառավարության սահմանած կարգով տրված փաստաթուղթ.</li>
                        <li><strong>11.</strong> Բարձրագույն դատական խորհրդի սահմանած ձևով համաձայնություն՝ իր վերաբերյալ պետական մարմիններից և պաշտոնատար անձանցից, հավակնորդին ներկայացվող պահանջների համապատասխանության ստուգման սահմաններում, անհրաժեշտ անձնական տվյալներ, այդ թվում` բժշկական գաղտնիք հանդիսացող և այլ տեղեկություններ ստանալու մասին.</li>
                        <li><strong>12.</strong> առավելագույնը երեք երաշխավորագիր-նամակ՝ ըստ հավակնորդի ցանկության.</li>
                        <li><strong>13.</strong> գրավոր հայտարարություն հայտում առկա տեղեկությունների և կից ներկայացված փաստաթղթերի հավաստիության մասին:</li>
                        <li>&nbsp;</li>
                    </ul>
                    </li>
                    <li><strong>3.</strong> Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվել հավակնող անձը (այսուհետ՝ հավակնորդ) որակավորման ստուգման մասին որոշման հրապարակման օրվան հաջորդող օրվանից մեկամսյա ժամկետում որակավորման ստուգմանը մասնակցելու համար Բարձրագույն դատական խորհուրդ է ներկայացնում Բարձրագույն դատական խորհրդի սահմանած ձևի հայտ:</li>
                    <li><strong>4.</strong> Հայերենին տիրապետելու հանգամանքը հավաստվում է ուսումնական հաստատություններում հայերենով կրթություն ստացած կամ կրթական ծրագրերով նախատեսված՝ հայոց լեզու առարկայի ուսումնառությունն ավարտած և ամփոփիչ ատեստավորում անցած լինելու վերաբերյալ ուսումնական հաստատությունների տված ավարտական փաստաթղթով (վկայական, ատեստատ, դիպլոմ): Հայերենին տիրապետելու հանգամանքը հավաստող ավարտական փաստաթղթի բացակայության դեպքում հայերենին տիրապետելու հանգամանքն ստուգվում է կրթության և գիտության ոլորտում Կառավարության քաղաքականությունը մշակող և իրականացնող նախարարի սահմանած կարգով, որը պետք է նախատեսի հայերենին տիրապետելու հանգամանքի ստուգման ողջամիտ, օբյեկտիվ չափորոշիչներ, ինչպես նաև գործընթացի վերահսկողության ընթացակարգեր:</li>
                    <li><strong>5.</strong> ՀՀ դատական օրենսգիրք սահմանադրական օրենքի իմաստով՝ մասնագիտական աշխատանքի փորձառությունը բակալավրի կամ դիպլոմավորված մասնագետի բարձրագույն իրավաբանական կրթության որակավորման աստիճան ձեռք բերելուց հետո իրավունքի ոլորտում իրականացված մասնագիտական գործունեությունն է, եթե այլ բան սահմանված չէ սույն օրենսգրքով:</li>
                    <li><strong>6.</strong> ՀՀ դատական օրենսգիրք սահմանադրական օրենքի 106-րդ հոդվածում, 123-րդ հոդվածի 6-րդ մասի 3-րդ կետում և 132-րդ հոդվածի 2-րդ մասի 3-րդ կետով նախատեսված անձանց համար մասնագիտական աշխատանքի փորձառություն է բարձրագույն ուսումնական հաստատությունում և (կամ) &laquo;Արդարադատության ակադեմիա&raquo; պետական ոչ առևտրային կազմակերպությունում, &laquo;Հայաստանի Հանրապետության փաստաբանական դպրոց&raquo; հիմնադրամում իրավունքի դասավանդումը կամ գիտական հաստատությունում իրավունքի ոլորտում կատարած գիտական աշխատանքը:</li>
                </ul>
                
                <h3>&nbsp;</h3>
                
                <h3><strong>Գրավոր քննություն.</strong>&nbsp;</h3>
                
                <p>&nbsp;</p>
                
                <p>Գրավոր քննությունը կազմակերպում է ԲԴԽ-ն: Քննությունն անցկացվում է համապատասխանաբար քրեական, քաղաքացիական կամ վարչական մասնագիտացման ոլորտում գրավոր առաջադրանքների միջոցով, որոնք, բացի տեսական իրավական գիտելիքների ստուգումից, ուղղված են նաև հավակնորդի վերլուծական և իրավակիրառ կարողությունների ստուգմանը:</p>
                
                <p>Գրավոր քննությանը ներկայացվող պահանջներն ու քննական նյութի բովանդակությանը ներկայացվող պահանջները, ներառյալ անցողիկ միավորները յուրաքանչյուր մինչև սեպտեմբերի 15-ը հաստատում է ԲԴԽ-ը: Ընդ որում, անցողիկը չի կարող պակաս լինել ընդհանուր միավորների 60 տոկոսից:</p>
                
                <p>Գրավոր քննությունից հավասար անցողիկ միավոր ունեցող բոլոր հավակնորդներն ընդգրկվում են ցուցակում և անցնում հաջորդ փուլ:</p>
                
                <h3>&nbsp;</h3>
                
                <h3><strong>Հարցազրույցի անցկացումը.</strong>&nbsp;</h3>
                
                <p>&nbsp;</p>
                
                <p>Հարցազրույցն իրականացվում է համալրված միասնական ցուցակի բոլոր անդամների համար, որում ներառվում են ինչպես գրավոր քննության փուլը հաղթահարած, այնպես էլ գիտական աստիճան ունեցող հավակնորդները:</p>
                
                <h3>&nbsp;</h3>
                
                <h3><strong>Հարցազրույցը կազմված է երկու մասից՝</strong>&nbsp;</h3>
                
                <p>&nbsp;</p>
                
                <p>Առաջին մասը ներառում է յուրաքանչյուր հավակնորդի անձնական գործի և անցած մասնագիտական փորձի ուսումնասիրությունը,</p>
                
                <p>Երկրորդ մասը ներառում է դատավորի վարքագծի կանոններին վերաբերող հիպոթետիկ խնդրի վերլուծություն և դիրքորոշման ներկայացում:</p>
                
                <p>Իրավագիտության բնագավառում գիտական աստիճան ունեցող անձանց համար հարցազրույցը վերը նշվածից բացի ներառում է նաև համապատասխան մասնագիտացման ոլորտում մեկ հակիրճ իրավական հարցի վերաբերյալ հավակնորդի կողմից իրականացվող վերլուծություն ու դիրքորոշման ներկայացում՝ կարճ ժամանակահատվածում հանպատրաստից կողմնորոշվելու, ինքնատիրապետման, վարվեցողության, հաղորդակցման հմտությունները, վերլուծական կարողությունները և դատավորի պաշտոնում արդյունավետ գործելու համար հավակնորդի անհրաժեշտ այլ հմտություններն ու որակները գնահատելու համար:</p>
                
                <p>ԲԴԽ հարցազրույցի արդյունքների ամփոփիչ քննարկման ավարտից հետո անցկացվում է գաղտնի քվեարկություն, որի ընթացքում Բարձրագույն դատական խորհրդի յուրաքանչյուր անդամ իր ներքին համոզմամբ քվեարկում է &laquo;կողմ&raquo; կամ &laquo;դեմ&raquo;: Ընդ որում, յուրաքանչյուր մասնագիտացման բաժնի համար կազմվում են առանձին քվեաթերթիկներ՝ ներառելով հարցազրույցին մասնակցած հավակնորդներին:</p>
                
                <p>Յուրաքանչյուր մասնագիտացման բաժնի համար քվեարկելիս հավակնորդների թիվն անհրաժեշտ քանակին հավասար կամ շատ լինելու դեպքում Բարձրագույն դատական խորհրդի անդամի ունեցած ձայների թիվը հավասար է համալրման համար անհրաժեշտ քանակին, իսկ քիչ լինելու դեպքում՝ հավակնորդների թվին: Եթե քվեարկության մասնակիցն ավելի ձայն է տվել, քան սահմանված է սույն մասով, ապա այդ քվեաթերթիկը համարվում է անվավեր:</p>
                
                <p>Յուրաքանչյուր մասնագիտացման բաժնի համար քվեարկության արդյունքներով Բարձրագույն դատական խորհրդի կողմից կազմվում է դատավորների թեկնածուների հավակնորդների ցուցակ, որում ընդգրկվում են անհրաժեշտ քանակին հավասար քանակի առավելագույն, սակայն ոչ պակաս, քան Բարձրագույն դատական խորհրդի անդամների ընդհանուր թվի ձայների առնվազն կեսից ավելի &laquo;կողմ&raquo; ձայներ ստացած հավակնորդները:</p>
                
                <p>Եթե ձայների հավասարության պատճառով հնարավոր չէ որոշել ընտրված թեկնածուներին, ապա անցկացվում է լրացուցիչ քվեարկություն: Լրացուցիչ քվեարկության արդյունքներով ընտրված են համարվում առավել ձայներ ստացած թեկնածուները: Ձայների հավասարության դեպքում նախապատվությունը տրվում է մասնագիտական աշխատանքի առավել երկար փորձառություն ունեցող թեկնածուին, իսկ փորձառության հավասարության դեպքում՝ տարիքով ավագին:</p>
                
                <p>&nbsp;</p>
                
                <p>Քվեարկության արդյունքում կազմված ցուցակը ԲԴԽ-ն ներկայացնում է Արդարադատության ակադեմիա՝ հավակնորդների ուսուցումը կազմակերպելու նպատակով:</p>
                
                <p>&nbsp;</p>
                
                <p>Գիտական աստիճան ունեցող հավակնորդի համար Արդարադատության ակադեմիայում կազմակերպվում է միայն գործնական հմտությունների զարգացման ուսուցում:</p>
                
                <p>&nbsp;</p>
                
                <p>Ավելի մանրամասն տես՝ ՀՀ դատական օրենսգիրք սահմանադրական օրենքի 95-121-րդ հոդվածները: Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվելու համար որակավորման ստուգմանը մասնակցելու համար հայտերի ներկայացման հետ կապված հարցերով անհրաժեշտ է դիմել ՀՀ բարձրագույն դատական խորհրդի աշխատակազմ:</p>',
            ],



            [
                'text' => '<h3><strong>Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվելու համար որակավորման ստուգմանը մասնակցելու համար ներկայացվող պահանջները.</strong>&nbsp;</h3>

                <p>&nbsp;</p>
                
                <p>Որակավորման ստուգմանը կարող են մասնակցել 25-ից 60 տարեկան, ընտրական իրավունք ունեցող անձինք, եթե՝</p>
                
                <p>&nbsp;</p>
                
                <ul>
                    <li><strong>1.</strong> ունեն միայն Հայաստանի Հանրապետության քաղաքացիություն.</li>
                    <li><strong>2.</strong> Հայաստանի Հանրապետությունում ստացել են իրավագիտության բակալավրի և իրավագիտության մագիստրոսի որակավորման աստիճան կամ դիպլոմավորված մասնագետի բարձրագույն իրավաբանական կրթության որակավորման աստիճան կամ համապատասխան աստիճան են ձեռք բերել օտարերկրյա պետությունում, որոնց ճանաչումն ու համարժեքության հաստատումը Հայաստանի Հանրապետությունում իրականացվել են օրենքով սահմանված կարգով.</li>
                    <li><strong>3.</strong> տիրապետում են հայերենին.</li>
                    <li><strong>4.</strong> ունեն անգլերեն, գերմաներեն, ռուսերեն և ֆրանսերեն լեզուներից առնվազն մեկի` ստանդարտացված թեստային համակարգերով ստուգվող լեզվական գիտելիքների` Բարձրագույն դատական խորհրդի սահմանած համապատասխան մակարդակի իմացություն.</li>
                    <li><strong>5.</strong> ունեն առնվազն երեք տարվա մասնագիտական աշխատանքի փորձառություն.</li>
                    <li><strong>6.</strong> առկա չեն դատավոր նշանակվելու ներքոնշյալ սահմանափակումները՝<br />
                    &nbsp;
                    <ul>
                        <li><strong>1.</strong> դատապարտվել է հանցագործության համար, և դատվածությունը մարված կամ հանված չէ.</li>
                        <li><strong>2.</strong> դատապարտվել է դիտավորյալ հանցագործության համար կամ ազատությունից զրկելու հետ կապված պատիժ է կրել` անկախ դատվածությունը մարված կամ հանված լինելու հանգամանքից.</li>
                        <li><strong>3.</strong> ունի դատավորի պաշտոնում նշանակվելուն խոչընդոտող ֆիզիկական արատ կամ հիվանդություն (ցանկը սահմանում է Կառավարությունը).</li>
                        <li><strong>4.</strong> չի անցել պարտադիր զինվորական ծառայություն կամ այլընտրանքային ծառայություն կամ օրենքով նախատեսված կարգով չի ազատվել պարտադիր զինվորական ծառայությունից (եթե անձն արական սեռի է).</li>
                        <li><strong>5.</strong> դատարանի՝ օրինական ուժի մեջ մտած վճռով ճանաչված է անգործունակ, սահմանափակ գործունակ, անհայտ բացակայող կամ սնանկ, և սնանկության վարույթը չի ավարտվել.</li>
                        <li><strong>6.</strong> նրա նկատմամբ հարուցված է քրեական հետապնդում:</li>
                    </ul>
                    </li>
                </ul>
                
                <p>&nbsp;</p>
                
                <p>Գիտական աստիճան ունեցող հավակնորդը, բացի վերը նշվածից, պետք է համապատասխանի հետևյալ չափանիշներին՝</p>
                
                <ul>
                    <li><strong>1.</strong> իրավագիտության բնագավառում ունի գիտական աստիճան,</li>
                    <li><strong>2.</strong> վերջին տասը տարիների ընթացքում առնվազն հինգ տարի դասավանդել է իրավունք բարձրագույն ուսումնական հաստատությունում կամ գիտական հաստատությունում կատարել է գիտական աշխատանք:</li>
                </ul>
                
                <p>&nbsp;</p>
                
                <p>Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվելու նպատակով անցկացվում է որակավորման ստուգում: Որակավորման ստուգումը բաղկացած է հետևյալ փուլերից.</p>
                
                <ul>
                    <li><strong>1.</strong> հայտի ներկայացում և ստուգում,</li>
                    <li><strong>2.</strong> գրավոր քննություն,</li>
                    <li><strong>3.</strong> հարցազրույցի անցկացում:</li>
                </ul>
                
                <p>&nbsp;</p>
                
                <p>Ընդ որում, գիտական աստիճան ունեցող հավակնորդները գրավոր քննության փուլին չեն մասնակցում:</p>
                
                <p>&nbsp;</p>
                
                <h3><strong>Հավակնորդի կողմից ներկայացվող փաստաթղթերը.</strong>&nbsp;</h3>
                
                <p>&nbsp;</p>
                
                <ul>
                    <li><strong>1.</strong> Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվել հավակնող անձը (այսուհետ՝ հավակնորդ) որակավորման ստուգման մասին որոշման հրապարակման օրվան հաջորդող օրվանից մեկամսյա ժամկետում որակավորման ստուգմանը մասնակցելու համար Բարձրագույն դատական խորհուրդ է ներկայացնում Բարձրագույն դատական խորհրդի սահմանած ձևի հայտ:</li>
                    <li><strong>2.</strong> Հայտին կից ներկայացվում են`<br />
                    &nbsp;
                    <ul>
                        <li><strong>1.</strong> անձը հաստատող փաստաթղթի, նույնականացման քարտի պատճենները և էլեկտրոնային փոստի հասցեն.</li>
                        <li><strong>2.</strong> հինգ գունավոր լուսանկար.</li>
                        <li><strong>3.</strong> իր կենսագրական տվյալները պարունակող քարտ.</li>
                        <li><strong>4.</strong> նոտարական կարգով հաստատված բանավոր հայտարարություն իր դատվածության և սնանկության կամ դրանց բացակայության մասին.</li>
                        <li><strong>5.</strong> իրավաբանական կրթության՝ պահանջվող որակավորման աստիճանի առկայությունը հավաստող փաստաթուղթ.</li>
                        <li><strong>6.</strong> հայերենին տիրապետելու հանգամանքը հավաստող փաստաթուղթ.</li>
                        <li><strong>7.</strong> պահանջվող օտար լեզուների՝ Բարձրագույն դատական խորհրդի սահմանած համապատասխան մակարդակին տիրապետելու հանգամանքը հավաստող փաստաթուղթ, բացառությամբ սույն հոդվածի 3.1-ին մասով նախատեսված դեպքի.</li>
                        <li><strong>8.</strong> պահանջվող մասնագիտական աշխատանքի փորձառությունը հավաստող ապացույց, այդ թվում՝ աշխատանքային պարտականությունները հավաստող պաշտոնի անձնագիր կամ այլ փաստաթղթեր.</li>
                        <li><strong>9.</strong> արական սեռի հավակնորդի դեպքում՝ պարտադիր զինվորական ծառայություն անցած լինելու հանգամանքը հավաստող կամ այլընտրանքային ծառայություն անցած լինելու կամ պարտադիր զինվորական ծառայությունից ազատված լինելու փաստը հավաստող փաստաթուղթ.</li>
                        <li><strong>10.</strong> դատավորի պաշտոնում նշանակմանը խոչընդոտող ֆիզիկական արատների և հիվանդությունների բացակայության մասին Կառավարության սահմանած կարգով տրված փաստաթուղթ.</li>
                        <li><strong>11.</strong> Բարձրագույն դատական խորհրդի սահմանած ձևով համաձայնություն՝ իր վերաբերյալ պետական մարմիններից և պաշտոնատար անձանցից, հավակնորդին ներկայացվող պահանջների համապատասխանության ստուգման սահմաններում, անհրաժեշտ անձնական տվյալներ, այդ թվում` բժշկական գաղտնիք հանդիսացող և այլ տեղեկություններ ստանալու մասին.</li>
                        <li><strong>12.</strong> առավելագույնը երեք երաշխավորագիր-նամակ՝ ըստ հավակնորդի ցանկության.</li>
                        <li><strong>13.</strong> գրավոր հայտարարություն հայտում առկա տեղեկությունների և կից ներկայացված փաստաթղթերի հավաստիության մասին:</li>
                        <li>&nbsp;</li>
                    </ul>
                    </li>
                    <li><strong>3.</strong> Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվել հավակնող անձը (այսուհետ՝ հավակնորդ) որակավորման ստուգման մասին որոշման հրապարակման օրվան հաջորդող օրվանից մեկամսյա ժամկետում որակավորման ստուգմանը մասնակցելու համար Բարձրագույն դատական խորհուրդ է ներկայացնում Բարձրագույն դատական խորհրդի սահմանած ձևի հայտ:</li>
                    <li><strong>4.</strong> Հայերենին տիրապետելու հանգամանքը հավաստվում է ուսումնական հաստատություններում հայերենով կրթություն ստացած կամ կրթական ծրագրերով նախատեսված՝ հայոց լեզու առարկայի ուսումնառությունն ավարտած և ամփոփիչ ատեստավորում անցած լինելու վերաբերյալ ուսումնական հաստատությունների տված ավարտական փաստաթղթով (վկայական, ատեստատ, դիպլոմ): Հայերենին տիրապետելու հանգամանքը հավաստող ավարտական փաստաթղթի բացակայության դեպքում հայերենին տիրապետելու հանգամանքն ստուգվում է կրթության և գիտության ոլորտում Կառավարության քաղաքականությունը մշակող և իրականացնող նախարարի սահմանած կարգով, որը պետք է նախատեսի հայերենին տիրապետելու հանգամանքի ստուգման ողջամիտ, օբյեկտիվ չափորոշիչներ, ինչպես նաև գործընթացի վերահսկողության ընթացակարգեր:</li>
                    <li><strong>5.</strong> ՀՀ դատական օրենսգիրք սահմանադրական օրենքի իմաստով՝ մասնագիտական աշխատանքի փորձառությունը բակալավրի կամ դիպլոմավորված մասնագետի բարձրագույն իրավաբանական կրթության որակավորման աստիճան ձեռք բերելուց հետո իրավունքի ոլորտում իրականացված մասնագիտական գործունեությունն է, եթե այլ բան սահմանված չէ սույն օրենսգրքով:</li>
                    <li><strong>6.</strong> ՀՀ դատական օրենսգիրք սահմանադրական օրենքի 106-րդ հոդվածում, 123-րդ հոդվածի 6-րդ մասի 3-րդ կետում և 132-րդ հոդվածի 2-րդ մասի 3-րդ կետով նախատեսված անձանց համար մասնագիտական աշխատանքի փորձառություն է բարձրագույն ուսումնական հաստատությունում և (կամ) &laquo;Արդարադատության ակադեմիա&raquo; պետական ոչ առևտրային կազմակերպությունում, &laquo;Հայաստանի Հանրապետության փաստաբանական դպրոց&raquo; հիմնադրամում իրավունքի դասավանդումը կամ գիտական հաստատությունում իրավունքի ոլորտում կատարած գիտական աշխատանքը:</li>
                </ul>
                
                <h3>&nbsp;</h3>
                
                <h3><strong>Գրավոր քննություն.</strong>&nbsp;</h3>
                
                <p>&nbsp;</p>
                
                <p>Գրավոր քննությունը կազմակերպում է ԲԴԽ-ն: Քննությունն անցկացվում է համապատասխանաբար քրեական, քաղաքացիական կամ վարչական մասնագիտացման ոլորտում գրավոր առաջադրանքների միջոցով, որոնք, բացի տեսական իրավական գիտելիքների ստուգումից, ուղղված են նաև հավակնորդի վերլուծական և իրավակիրառ կարողությունների ստուգմանը:</p>
                
                <p>Գրավոր քննությանը ներկայացվող պահանջներն ու քննական նյութի բովանդակությանը ներկայացվող պահանջները, ներառյալ անցողիկ միավորները յուրաքանչյուր մինչև սեպտեմբերի 15-ը հաստատում է ԲԴԽ-ը: Ընդ որում, անցողիկը չի կարող պակաս լինել ընդհանուր միավորների 60 տոկոսից:</p>
                
                <p>Գրավոր քննությունից հավասար անցողիկ միավոր ունեցող բոլոր հավակնորդներն ընդգրկվում են ցուցակում և անցնում հաջորդ փուլ:</p>
                
                <h3>&nbsp;</h3>
                
                <h3><strong>Հարցազրույցի անցկացումը.</strong>&nbsp;</h3>
                
                <p>&nbsp;</p>
                
                <p>Հարցազրույցն իրականացվում է համալրված միասնական ցուցակի բոլոր անդամների համար, որում ներառվում են ինչպես գրավոր քննության փուլը հաղթահարած, այնպես էլ գիտական աստիճան ունեցող հավակնորդները:</p>
                
                <h3>&nbsp;</h3>
                
                <h3><strong>Հարցազրույցը կազմված է երկու մասից՝</strong>&nbsp;</h3>
                
                <p>&nbsp;</p>
                
                <p>Առաջին մասը ներառում է յուրաքանչյուր հավակնորդի անձնական գործի և անցած մասնագիտական փորձի ուսումնասիրությունը,</p>
                
                <p>Երկրորդ մասը ներառում է դատավորի վարքագծի կանոններին վերաբերող հիպոթետիկ խնդրի վերլուծություն և դիրքորոշման ներկայացում:</p>
                
                <p>Իրավագիտության բնագավառում գիտական աստիճան ունեցող անձանց համար հարցազրույցը վերը նշվածից բացի ներառում է նաև համապատասխան մասնագիտացման ոլորտում մեկ հակիրճ իրավական հարցի վերաբերյալ հավակնորդի կողմից իրականացվող վերլուծություն ու դիրքորոշման ներկայացում՝ կարճ ժամանակահատվածում հանպատրաստից կողմնորոշվելու, ինքնատիրապետման, վարվեցողության, հաղորդակցման հմտությունները, վերլուծական կարողությունները և դատավորի պաշտոնում արդյունավետ գործելու համար հավակնորդի անհրաժեշտ այլ հմտություններն ու որակները գնահատելու համար:</p>
                
                <p>ԲԴԽ հարցազրույցի արդյունքների ամփոփիչ քննարկման ավարտից հետո անցկացվում է գաղտնի քվեարկություն, որի ընթացքում Բարձրագույն դատական խորհրդի յուրաքանչյուր անդամ իր ներքին համոզմամբ քվեարկում է &laquo;կողմ&raquo; կամ &laquo;դեմ&raquo;: Ընդ որում, յուրաքանչյուր մասնագիտացման բաժնի համար կազմվում են առանձին քվեաթերթիկներ՝ ներառելով հարցազրույցին մասնակցած հավակնորդներին:</p>
                
                <p>Յուրաքանչյուր մասնագիտացման բաժնի համար քվեարկելիս հավակնորդների թիվն անհրաժեշտ քանակին հավասար կամ շատ լինելու դեպքում Բարձրագույն դատական խորհրդի անդամի ունեցած ձայների թիվը հավասար է համալրման համար անհրաժեշտ քանակին, իսկ քիչ լինելու դեպքում՝ հավակնորդների թվին: Եթե քվեարկության մասնակիցն ավելի ձայն է տվել, քան սահմանված է սույն մասով, ապա այդ քվեաթերթիկը համարվում է անվավեր:</p>
                
                <p>Յուրաքանչյուր մասնագիտացման բաժնի համար քվեարկության արդյունքներով Բարձրագույն դատական խորհրդի կողմից կազմվում է դատավորների թեկնածուների հավակնորդների ցուցակ, որում ընդգրկվում են անհրաժեշտ քանակին հավասար քանակի առավելագույն, սակայն ոչ պակաս, քան Բարձրագույն դատական խորհրդի անդամների ընդհանուր թվի ձայների առնվազն կեսից ավելի &laquo;կողմ&raquo; ձայներ ստացած հավակնորդները:</p>
                
                <p>Եթե ձայների հավասարության պատճառով հնարավոր չէ որոշել ընտրված թեկնածուներին, ապա անցկացվում է լրացուցիչ քվեարկություն: Լրացուցիչ քվեարկության արդյունքներով ընտրված են համարվում առավել ձայներ ստացած թեկնածուները: Ձայների հավասարության դեպքում նախապատվությունը տրվում է մասնագիտական աշխատանքի առավել երկար փորձառություն ունեցող թեկնածուին, իսկ փորձառության հավասարության դեպքում՝ տարիքով ավագին:</p>
                
                <p>&nbsp;</p>
                
                <p>Քվեարկության արդյունքում կազմված ցուցակը ԲԴԽ-ն ներկայացնում է Արդարադատության ակադեմիա՝ հավակնորդների ուսուցումը կազմակերպելու նպատակով:</p>
                
                <p>&nbsp;</p>
                
                <p>Գիտական աստիճան ունեցող հավակնորդի համար Արդարադատության ակադեմիայում կազմակերպվում է միայն գործնական հմտությունների զարգացման ուսուցում:</p>
                
                <p>&nbsp;</p>
                
                <p>Ավելի մանրամասն տես՝ ՀՀ դատական օրենսգիրք սահմանադրական օրենքի 95-121-րդ հոդվածները: Դատավորի թեկնածուների հավակնորդների ցուցակում ընդգրկվելու համար որակավորման ստուգմանը մասնակցելու համար հայտերի ներկայացման հետ կապված հարցերով անհրաժեշտ է դիմել ՀՀ բարձրագույն դատական խորհրդի աշխատակազմ:</p>',
            ],
        ]);
    }
}
