<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DistanceLearningCourseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('distance_learning_courses')->insert([
            [
                'name_en' => 'Refugee law Administrative',
                'name_am' => 'Փախստականների իրավունք վարչական ուղղվածություն',
                'name_ru' => 'Права беженцев Административный',
                'syllabus_en' => '<p><strong>ՓԱԽՍՏԱԿԱՆՆԵՐԻ ԻՐԱՎՈՒՆՔ ՀԵՌԱՈՒՍՈՒՑՄԱՆ ԴԱՍԸՆԹԱՑԻ ԾՐԱԳԻՐ</strong></p>
                <p>&nbsp;</p>
                <p>Վերջին տարիներին աշխարհում նկատվում է փախստականների քանակի հսկայական աճ, ինչն էական ազդեցություն է ունեցել և ունի նաև Հայաստանի Հանրապետության վրա, որը բնակչության մեկ շնչի հաշվով փախստականների և տեղահանված անձանց քանակով առաջատարներից է Եվրոպայում։ Հանգամանք, որը հրատապ է դարձնում փախստականների իրավունքի իմացությունն ու դրա հիման վրա համապատասխան քայլերի իրագործումը: Ավելին, թեև առօրյա խոսքում ընդունված է փախստական անվանել հետապնդումների կամ բռնությունների պատճառով իրենց տները լքած բոլոր անձանց, իրավաբանորեն փախստական եզրույթն ունի համեմատաբար նեղ իմաստ։ Որպես հետևանք, տեղահանված անձին փախստականի կարգավիճակ շնորհելու որոշումը ենթադրում է բարդ գործընթաց ինչպես փաստերի ուսումնասիրման ու գնահատման, այնպես էլ փախստականների պաշտպանության ոլորտում միջազգային և ներպետական իրավունքի նորմերի համակողմանի վերլուծության առումով։ Այս գործընթացի արդյունավետ իրականացումն անհնար է առանց փախստականների իրավունքի առանցքային հասկացությունների, սկզբունքների և ընթացակարգերի լավ իմացության։</p>',



                'syllabus_am' => '<p><strong>ՓԱԽՍՏԱԿԱՆՆԵՐԻ ԻՐԱՎՈՒՆՔ ՀԵՌԱՈՒՍՈՒՑՄԱՆ ԴԱՍԸՆԹԱՑԻ ԾՐԱԳԻՐ</strong></p>
                <p>&nbsp;</p>
                <p>Վերջին տարիներին աշխարհում նկատվում է փախստականների քանակի հսկայական աճ, ինչն էական ազդեցություն է ունեցել և ունի նաև Հայաստանի Հանրապետության վրա, որը բնակչության մեկ շնչի հաշվով փախստականների և տեղահանված անձանց քանակով առաջատարներից է Եվրոպայում։ Հանգամանք, որը հրատապ է դարձնում փախստականների իրավունքի իմացությունն ու դրա հիման վրա համապատասխան քայլերի իրագործումը: Ավելին, թեև առօրյա խոսքում ընդունված է փախստական անվանել հետապնդումների կամ բռնությունների պատճառով իրենց տները լքած բոլոր անձանց, իրավաբանորեն փախստական եզրույթն ունի համեմատաբար նեղ իմաստ։ Որպես հետևանք, տեղահանված անձին փախստականի կարգավիճակ շնորհելու որոշումը ենթադրում է բարդ գործընթաց ինչպես փաստերի ուսումնասիրման ու գնահատման, այնպես էլ փախստականների պաշտպանության ոլորտում միջազգային և ներպետական իրավունքի նորմերի համակողմանի վերլուծության առումով։ Այս գործընթացի արդյունավետ իրականացումն անհնար է առանց փախստականների իրավունքի առանցքային հասկացությունների, սկզբունքների և ընթացակարգերի լավ իմացության։</p>',



                'syllabus_ru' => '<p><strong>ՓԱԽՍՏԱԿԱՆՆԵՐԻ ԻՐԱՎՈՒՆՔ ՀԵՌԱՈՒՍՈՒՑՄԱՆ ԴԱՍԸՆԹԱՑԻ ԾՐԱԳԻՐ</strong></p>
                <p>&nbsp;</p>
                <p>Վերջին տարիներին աշխարհում նկատվում է փախստականների քանակի հսկայական աճ, ինչն էական ազդեցություն է ունեցել և ունի նաև Հայաստանի Հանրապետության վրա, որը բնակչության մեկ շնչի հաշվով փախստականների և տեղահանված անձանց քանակով առաջատարներից է Եվրոպայում։ Հանգամանք, որը հրատապ է դարձնում փախստականների իրավունքի իմացությունն ու դրա հիման վրա համապատասխան քայլերի իրագործումը: Ավելին, թեև առօրյա խոսքում ընդունված է փախստական անվանել հետապնդումների կամ բռնությունների պատճառով իրենց տները լքած բոլոր անձանց, իրավաբանորեն փախստական եզրույթն ունի համեմատաբար նեղ իմաստ։ Որպես հետևանք, տեղահանված անձին փախստականի կարգավիճակ շնորհելու որոշումը ենթադրում է բարդ գործընթաց ինչպես փաստերի ուսումնասիրման ու գնահատման, այնպես էլ փախստականների պաշտպանության ոլորտում միջազգային և ներպետական իրավունքի նորմերի համակողմանի վերլուծության առումով։ Այս գործընթացի արդյունավետ իրականացումն անհնար է առանց փախստականների իրավունքի առանցքային հասկացությունների, սկզբունքների և ընթացակարգերի լավ իմացության։</p>',




                'syllabus_pdf_name_en' => 'Ծրագրի ամբողջական տարբերակ',
                'syllabus_pdf_name_am' => 'Ծրագրի ամբողջական տարբերակ',
                'syllabus_pdf_name_ru' => 'Ծրագրի ամբողջական տարբերակ',
                'img' => 'distance-learning/courses/qB3QBRPZy1JnFzpUIxVsjYfOnMqYG2vDQOfGsA2C.jpg',
                'syllabus_pdf' => 'distance-learning/courses/n7D4gDxpwsWqsdxtHQIJuyQOMSX7JKyQsv8zbUFz.pdf',
            ],

            [
                'name_en' => 'Refugee law Criminal',
                'name_am' => 'Փախստականների իրավունք քրեական ուղղվածություն',
                'name_ru' => 'Права беженцев Уголовный',
                'syllabus_en' => '<p><strong>ՓԱԽՍՏԱԿԱՆՆԵՐԻ ԻՐԱՎՈՒՆՔ ՀԵՌԱՈՒՍՈՒՑՄԱՆ ԴԱՍԸՆԹԱՑԻ ԾՐԱԳԻՐ</strong></p>
                <p>&nbsp;</p>
                <p>Վերջին տարիներին աշխարհում նկատվում է փախստականների քանակի հսկայական աճ, ինչն էական ազդեցություն է ունեցել և ունի նաև Հայաստանի Հանրապետության վրա, որը բնակչության մեկ շնչի հաշվով փախստականների և տեղահանված անձանց քանակով առաջատարներից է Եվրոպայում։ Անձին փախստականի կարգավիճակ շնորհելու որոշումը ենթադրում է բարդ գործընթաց ինչպես փաստերի ուսումնասիրման ու գնահատման, այնպես էլ փախստականների պաշտպանության ոլորտում միջազգային և ներպետական իրավունքի նորմերի համակողմանի վերլուծության առումով։ Որպես կանոն համապատասխան գործընթացը իրականացվում է միգրացիայի ոլորտում լիազորված պետական մարմնի կողմից, իսկ դրա հետ կապված դատական վեճերը քննվում են վարչական դատարաններում։ Սակայն քրեական օրենսգրքով ապաստան հայցողների ու փախստականների մասով հատուկ դրույթները (329-րդ հոդվածի 3-րդ մաս), հանձնման գործընթացներում չվերադարձելիության սկզբունքի կիրառման առումով փախստականների մասով առկա հատուկ երաշխիքները, ինչպես նաև փախստականների իրավունքների պաշտպանության քրեադատավարական երաշխիքները, ենթադրում են փախստականների իրավունքի առանցքային հասկացությունների, սկզբունքների և ընթացակարգերի լավ իմացության անհրաժեշտություն նաև համապատասխան գործընթացում ներգրավված մարմինների մասով։</p>',



                'syllabus_am' => '<p><strong>ՓԱԽՍՏԱԿԱՆՆԵՐԻ ԻՐԱՎՈՒՆՔ ՀԵՌԱՈՒՍՈՒՑՄԱՆ ԴԱՍԸՆԹԱՑԻ ԾՐԱԳԻՐ</strong></p>
                <p>&nbsp;</p>
                <p>Վերջին տարիներին աշխարհում նկատվում է փախստականների քանակի հսկայական աճ, ինչն էական ազդեցություն է ունեցել և ունի նաև Հայաստանի Հանրապետության վրա, որը բնակչության մեկ շնչի հաշվով փախստականների և տեղահանված անձանց քանակով առաջատարներից է Եվրոպայում։ Անձին փախստականի կարգավիճակ շնորհելու որոշումը ենթադրում է բարդ գործընթաց ինչպես փաստերի ուսումնասիրման ու գնահատման, այնպես էլ փախստականների պաշտպանության ոլորտում միջազգային և ներպետական իրավունքի նորմերի համակողմանի վերլուծության առումով։ Որպես կանոն համապատասխան գործընթացը իրականացվում է միգրացիայի ոլորտում լիազորված պետական մարմնի կողմից, իսկ դրա հետ կապված դատական վեճերը քննվում են վարչական դատարաններում։ Սակայն քրեական օրենսգրքով ապաստան հայցողների ու փախստականների մասով հատուկ դրույթները (329-րդ հոդվածի 3-րդ մաս), հանձնման գործընթացներում չվերադարձելիության սկզբունքի կիրառման առումով փախստականների մասով առկա հատուկ երաշխիքները, ինչպես նաև փախստականների իրավունքների պաշտպանության քրեադատավարական երաշխիքները, ենթադրում են փախստականների իրավունքի առանցքային հասկացությունների, սկզբունքների և ընթացակարգերի լավ իմացության անհրաժեշտություն նաև համապատասխան գործընթացում ներգրավված մարմինների մասով։</p>',



                'syllabus_ru' => '<p><strong>ՓԱԽՍՏԱԿԱՆՆԵՐԻ ԻՐԱՎՈՒՆՔ ՀԵՌԱՈՒՍՈՒՑՄԱՆ ԴԱՍԸՆԹԱՑԻ ԾՐԱԳԻՐ</strong></p>
                <p>&nbsp;</p>
                <p>Վերջին տարիներին աշխարհում նկատվում է փախստականների քանակի հսկայական աճ, ինչն էական ազդեցություն է ունեցել և ունի նաև Հայաստանի Հանրապետության վրա, որը բնակչության մեկ շնչի հաշվով փախստականների և տեղահանված անձանց քանակով առաջատարներից է Եվրոպայում։ Անձին փախստականի կարգավիճակ շնորհելու որոշումը ենթադրում է բարդ գործընթաց ինչպես փաստերի ուսումնասիրման ու գնահատման, այնպես էլ փախստականների պաշտպանության ոլորտում միջազգային և ներպետական իրավունքի նորմերի համակողմանի վերլուծության առումով։ Որպես կանոն համապատասխան գործընթացը իրականացվում է միգրացիայի ոլորտում լիազորված պետական մարմնի կողմից, իսկ դրա հետ կապված դատական վեճերը քննվում են վարչական դատարաններում։ Սակայն քրեական օրենսգրքով ապաստան հայցողների ու փախստականների մասով հատուկ դրույթները (329-րդ հոդվածի 3-րդ մաս), հանձնման գործընթացներում չվերադարձելիության սկզբունքի կիրառման առումով փախստականների մասով առկա հատուկ երաշխիքները, ինչպես նաև փախստականների իրավունքների պաշտպանության քրեադատավարական երաշխիքները, ենթադրում են փախստականների իրավունքի առանցքային հասկացությունների, սկզբունքների և ընթացակարգերի լավ իմացության անհրաժեշտություն նաև համապատասխան գործընթացում ներգրավված մարմինների մասով։</p>',




                'syllabus_pdf_name_en' => 'Ծրագրի ամբողջական տարբերակ',
                'syllabus_pdf_name_am' => 'Ծրագրի ամբողջական տարբերակ',
                'syllabus_pdf_name_ru' => 'Ծրագրի ամբողջական տարբերակ',
                'img' => 'distance-learning/courses/Wudaqqm6rHO92NvdFLjFEbd4CfXBBuP6AFR5vyfT.jpg',
                'syllabus_pdf' => 'distance-learning/courses/m6prMrpptUFheDA1wmqzdRlLjJyxpT07RjFtKRFa.pdf',
            ],

            [
                'name_en' => 'Protection of children\'s rights during criminal procedures',
                'name_am' => 'Անչափահասի պաշտպանությունը քրեական գործերով վարույթի ընթացքում',
                'name_ru' => 'Зашита прав несовершеннолетних в уголовном процессе',
                'syllabus_en' => '<p><strong>ԱՆՉԱՓԱՀԱՍԻ ՊԱՇՏՊԱՆՈՒԹՅՈՒՆԸ ՔՐԵԱԿԱՆ ԳՈՐԾԵՐՈՎ ՎԱՐՈՒՅԹԻ ԸՆԹԱՑՔՈՒՄ ՀԵՌԱՈՒՍՈՒՑՄԱՆ ԴԱՍԸՆԹԱՑԻ ԾՐԱԳԻՐ</strong></p>
                <p>&nbsp;</p>
                <p>Անչափահասների արդարադատության գաղափարը վերջին ժամանակների զարգացումներից է: Մինչև XIX դարը անչափահաս և չափահաս անձանց նկատմամբ կիրառվում էին քրեական դատավարության նույն ընթացակարգերը: ՀՀ արդարադատության համակարգում բարեփոխումներ են իրականացվում 2001 թվականից ի վեր՝ առաջ քաշելով երեխայի լավագույն շահի վերաբերյալ թեզը: Բարեփոխումները կոչված են հաղթահարելու ոլորտում առկա դժվարությունները, սակայն միևնույն ժամանակ ոլորտում առաջանում և հրատապ լուծում են պահանջում մի շարք սոցիալական և իրավական բնույթի հիմնախնդիրներ: Այդ խնդիրներից մեկն է անչափահասների արդարադատության հարցերով զբաղվող առանցքային դերակատարների՝ դատավորների, դատախազների, ինչպես նաև արդարադատության համակարգի այլ աշխատակիցների մասնագիտական վերապատրաստումները, որոնք հատկապես կարևոր են անչափահասների գործերով առանձին դատարաններ չունենալու պարագայում: Իրավախախտում կատարած անչափահասի վերաբերյալ որոշումը ենթադրում է բարդ գործընթաց ինչպես փաստերի ուսումնասիրման ու գնահատման, այնպես էլ անչափահասների իրավունքների պաշտպանության ոլորտում միջազգային և ներպետական իրավունքի նորմերի համակողմանի վերլուծության առումով։ Այս գործընթացի արդյունավետ իրականացումն անհնար է առանց անչափահաս իրավախախտի իրավունքի առանցքային հասկացությունների, սկզբունքների և ընթացակարգերի լավ իմացության։</p>',



                'syllabus_am' => '<p><strong>ԱՆՉԱՓԱՀԱՍԻ ՊԱՇՏՊԱՆՈՒԹՅՈՒՆԸ ՔՐԵԱԿԱՆ ԳՈՐԾԵՐՈՎ ՎԱՐՈՒՅԹԻ ԸՆԹԱՑՔՈՒՄ ՀԵՌԱՈՒՍՈՒՑՄԱՆ ԴԱՍԸՆԹԱՑԻ ԾՐԱԳԻՐ</strong></p>
                <p>&nbsp;</p>
                <p>Անչափահասների արդարադատության գաղափարը վերջին ժամանակների զարգացումներից է: Մինչև XIX դարը անչափահաս և չափահաս անձանց նկատմամբ կիրառվում էին քրեական դատավարության նույն ընթացակարգերը: ՀՀ արդարադատության համակարգում բարեփոխումներ են իրականացվում 2001 թվականից ի վեր՝ առաջ քաշելով երեխայի լավագույն շահի վերաբերյալ թեզը: Բարեփոխումները կոչված են հաղթահարելու ոլորտում առկա դժվարությունները, սակայն միևնույն ժամանակ ոլորտում առաջանում և հրատապ լուծում են պահանջում մի շարք սոցիալական և իրավական բնույթի հիմնախնդիրներ: Այդ խնդիրներից մեկն է անչափահասների արդարադատության հարցերով զբաղվող առանցքային դերակատարների՝ դատավորների, դատախազների, ինչպես նաև արդարադատության համակարգի այլ աշխատակիցների մասնագիտական վերապատրաստումները, որոնք հատկապես կարևոր են անչափահասների գործերով առանձին դատարաններ չունենալու պարագայում: Իրավախախտում կատարած անչափահասի վերաբերյալ որոշումը ենթադրում է բարդ գործընթաց ինչպես փաստերի ուսումնասիրման ու գնահատման, այնպես էլ անչափահասների իրավունքների պաշտպանության ոլորտում միջազգային և ներպետական իրավունքի նորմերի համակողմանի վերլուծության առումով։ Այս գործընթացի արդյունավետ իրականացումն անհնար է առանց անչափահաս իրավախախտի իրավունքի առանցքային հասկացությունների, սկզբունքների և ընթացակարգերի լավ իմացության։</p>',



                'syllabus_ru' => '<p><strong>ԱՆՉԱՓԱՀԱՍԻ ՊԱՇՏՊԱՆՈՒԹՅՈՒՆԸ ՔՐԵԱԿԱՆ ԳՈՐԾԵՐՈՎ ՎԱՐՈՒՅԹԻ ԸՆԹԱՑՔՈՒՄ ՀԵՌԱՈՒՍՈՒՑՄԱՆ ԴԱՍԸՆԹԱՑԻ ԾՐԱԳԻՐ</strong></p>
                <p>&nbsp;</p>
                <p>Անչափահասների արդարադատության գաղափարը վերջին ժամանակների զարգացումներից է: Մինչև XIX դարը անչափահաս և չափահաս անձանց նկատմամբ կիրառվում էին քրեական դատավարության նույն ընթացակարգերը: ՀՀ արդարադատության համակարգում բարեփոխումներ են իրականացվում 2001 թվականից ի վեր՝ առաջ քաշելով երեխայի լավագույն շահի վերաբերյալ թեզը: Բարեփոխումները կոչված են հաղթահարելու ոլորտում առկա դժվարությունները, սակայն միևնույն ժամանակ ոլորտում առաջանում և հրատապ լուծում են պահանջում մի շարք սոցիալական և իրավական բնույթի հիմնախնդիրներ: Այդ խնդիրներից մեկն է անչափահասների արդարադատության հարցերով զբաղվող առանցքային դերակատարների՝ դատավորների, դատախազների, ինչպես նաև արդարադատության համակարգի այլ աշխատակիցների մասնագիտական վերապատրաստումները, որոնք հատկապես կարևոր են անչափահասների գործերով առանձին դատարաններ չունենալու պարագայում: Իրավախախտում կատարած անչափահասի վերաբերյալ որոշումը ենթադրում է բարդ գործընթաց ինչպես փաստերի ուսումնասիրման ու գնահատման, այնպես էլ անչափահասների իրավունքների պաշտպանության ոլորտում միջազգային և ներպետական իրավունքի նորմերի համակողմանի վերլուծության առումով։ Այս գործընթացի արդյունավետ իրականացումն անհնար է առանց անչափահաս իրավախախտի իրավունքի առանցքային հասկացությունների, սկզբունքների և ընթացակարգերի լավ իմացության։</p>',




                'syllabus_pdf_name_en' => 'Ծրագրի ամբողջական տարբերակ',
                'syllabus_pdf_name_am' => 'Ծրագրի ամբողջական տարբերակ',
                'syllabus_pdf_name_ru' => 'Ծրագրի ամբողջական տարբերակ',
                'img' => 'distance-learning/courses/SXTc71Ot0MEMaNo0t1FbeuHs8lrqAx6GhIMKwQJJ.jpg',
                'syllabus_pdf' => 'distance-learning/courses/Kj01nw7xcihv14XhAYbCFEVB9ri9OuQcxM9Y7J0Z.pdf',
            ],
        ]);
    }
}
