<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class FAQSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('frequently_asked_questions')->insert([
            [
                'title_en' => 'FAQ',
                'title_am' => 'Հաճախակի տրվող հարցեր',
                'title_ru' => 'Часто Задаваемые Вопросы',


                'text_en' => '<p><strong>1. Ո՞րն է ինքնաստուգիչ հարցերին սխալ պատասխանելու հետևանքը:</strong></p>
                
                <p>Ունկնդիրը համարվում է դասընթացի տվյալ դասին մասնակցած, եթե պատասխանել է այդ դասի ինքնաստուգիչ հարցերին: Իսկ սա նշանակում է, որ Ձեր տված պատասխանների ճիշտ կամ սխալ լինելը որևէ կերպ չի կարող ազդել դասընթացին Ձեր մասնակցությունը որոշելու վրա:</p>
                
                <p>&nbsp;</p>
                
                <p><strong>2. Եթե ես գտնվում եմ արձակուրդում կամ գործուղման մեջ՝ ինչպե՞ս կարող եմ մասնակցել դասընթացին:</strong><br />
                Արձակուրդում կամ գործուղման մեջ գտնվելու փաստը չի խոչընդոտում Ձեր մասնակցությանը կոնկրետ դասընթացին, քանի որ վերջինս իրականացվում է առցանց: Իսկ դա նշանակում է, որ դասընթացի նյութերին կարող եք ծանոթանալ (ինչպես նաև պատասխանել ինքնաստուգիչ հարցերին) Ձեզ հարմար ցանկացած ժամի և վայրում՝ դասավանդման պլանով սահմանված ճկուն ժամկետների սահմաններում:</p>
                
                <p>&nbsp;</p>
                
                <p><strong>3. Հաշվի առնվելո՞ւ են արդյոք ինքնաստուգիչ հարցերի այն պատասխանները, որոնք ներկայացվել են դասավանդման պլանով սահմանված ժամկետների խախտմամբ:</strong></p>
                
                <p>Ո՛չ: Հաշվի չեն առնվելու: Դասավանդման պլանով հստակ սահմանված է, որ տվյալ շաբաթվա/դասի ինքնաստուգիչ հարցերի պատասխանները պետք է ներկայացվեն մինչև տվյալ օրվա այսինչ ժամը, իսկ սահմանված ժամկետի խախտման դեպքում այդ պատասխանները հաշվի չեն առնվի և Դուք կհամարվեք տվյալ դասին չմասնակցած (4 ժամ բացակա ստացած):</p>
                
                <p>&nbsp;</p>
                
                <p><strong>4. Ինքնաստուգիչ հարցերին պատասխանելու համար բավարար կլինի՞ արդյոք մեզ տրամադրվող ուսումնական նյութը:</strong></p>
                
                <p>Իհարկե՝ բավարար կլինի: Կոնկրետ շաբաթվա/դասի ինքնաստուգիչ հարցերը կազմված են բացառապես այդ նույն դասի ուսումնական նյութի հիման վրա: Այսինքն՝ տվյալ շաբաթվա/դասի ուսումնական նյութին ծանոթանալով և այն յուրացնելով՝ սկզբունքորեն կարող եք ապահովել ճիշտ պատասխանների 100%-անոց արդյունք:</p>
                
                <p>&nbsp;</p>
                
                <p><strong>5. Պարտադի՞ր է արդյոք ուսումնական նյութերում տեղ գտած տեսանյութերի դիտումը:</strong></p>
                
                <p>Այդ տեսանյութերի դիտումը ոչ թե պարտադիր է, այլ ցանկալի, քանի որ դրանք միտված են համապատասխան շաբաթվա/դասի ուսումնական նյութն առավել հետաքրքիր, ուշագրավ և պատկերավոր դարձնելուն, ինչպես նաև դրա գործնական կարևորությունը ընդգծելուն:</p>
                
                <p>&nbsp;</p>
                
                <p><strong>6. Եթե հեռուսուցման դասընթացի ընթացքում հիվանդանում եմ կամ այլ օբյեկտիվ պատճառներով հնարավորություն չեմ ունենում պատասխանել մի քանի դասերի ինքնաստուգիչ հարցերին, ապա իրավունք ունե՞մ արդյոք պատասխանելու դրանց մինչև դասընթացի ավարտը:</strong></p>
                
                <p>Նման հնարավորություն նախատեսված չէ:</p>
                
                <p>&nbsp;</p>
                
                <p><strong>7. Եթե դասավանդման պլանով սահմանված ժամկետներում ունկնդիրը չի ստացել համապատասխան նյութերը, ապա նա ինչպես պետք է վարվի:</strong></p>
                
                <p>Թեպետ նյութերը չստանալու հավանականությունը բավականին ցածր է, սակայն դա չի կարելի սկզբունքորեն բացառված համարել: Եթե որևէ տեխնիկական խոտանի պատճառով չեք ստացել համապատասխան նյութերը, ապա.&nbsp;<br />
                կարող եք մինչև նյութերի ստացման աշխատանքային օրվա ավարտը՝ սահմանված Ձեր դասավանդման պլանով, կապ հաստատել Ակադեմիայի հեռաուսուցման վարչության աշխատակիցների հետ (նրանց հեռախոսահամարները Ձեզ նախապես տրվելու են) և տեղեկացնել առաջացած խնդրի մասին:</p>
                
                <p>&nbsp;</p>
                
                <p><strong>8. Եթե դասավանդման պլանով սահմանված ժամկետում ունկնդիրն ուղարկել է ինքնաստուգիչ հարցերի պատասխանները, ապա ինչպես վստահ լինի, որ այն հասել է հասցեատիրոջը:</strong></p>
                
                <p>Ինքնաստուգիչ հարցերի պատասխաններն ուղարկելուց հետո ունկնդիրն իր էլէկտրոնային փոստին կստանա համապատասխան հավաստում առ այն, որ իր ուղարկած փաստաթուղթը հասել է հասցեատիրոջը: Եթե ինչ-ինչ պատճառներով այդ հավաստումը չեք ստացել, ապա պետք է 24 ժամվա ընթացքում կապ հաստատեք Ակադեմիայի հեռաուսուցման վարչության աշխատակիցների հետ՝ ներկայացնելով խնդիրը: 24 ժամվա ընթացքում կապ չհաստատելու և խնդրի չկարգավորման դեպքում ունկնդիրը կհամարվի տվյալ դասին չմասնակցած (4 ժամ բացակա ստացած):</p>
                
                <p>&nbsp;</p>
                
                <p><strong>9. Դասավանդման պլանում նշված է, որ կան դասախոսի հետ հաղորդակցության օրեր և ժամեր: Պարտավո՞ր ենք արդյոք նշված ժամկետներում կապ հաստատել և հաղորդակցվել դասախոսի հետ:</strong></p>
                
                <p>Ո՛չ, պարտավոր չեք: Դասախոսի հետ հաղորդակցումը նախատեսված է ուսումնական նյութերի մասով ԲՈՎԱՆԴԱԿԱՅԻՆ բնույթի հարցերի դեպքում:</p>
                
                <p>&nbsp;</p>
                
                <p><strong>10. Կարո՞ղ եմ օգտվել ուրիշ ունկնդրի էլեկտրոնային փոստից:</strong></p>
                
                <p>Ո՛չ, չեք կարող: Յուրաքանչյուր ունկնդիր պարտավոր է ունենալ սեփական էլեկտրոնային փոստ:</p>',



                'text_am' => '<p><strong>1. Ո՞րն է ինքնաստուգիչ հարցերին սխալ պատասխանելու հետևանքը:</strong></p>

                <p>Ունկնդիրը համարվում է դասընթացի տվյալ դասին մասնակցած, եթե պատասխանել է այդ դասի ինքնաստուգիչ հարցերին: Իսկ սա նշանակում է, որ Ձեր տված պատասխանների ճիշտ կամ սխալ լինելը որևէ կերպ չի կարող ազդել դասընթացին Ձեր մասնակցությունը որոշելու վրա:</p>

                <p>&nbsp;</p>

                <p><strong>2. Եթե ես գտնվում եմ արձակուրդում կամ գործուղման մեջ՝ ինչպե՞ս կարող եմ մասնակցել դասընթացին:</strong><br />
                Արձակուրդում կամ գործուղման մեջ գտնվելու փաստը չի խոչընդոտում Ձեր մասնակցությանը կոնկրետ դասընթացին, քանի որ վերջինս իրականացվում է առցանց: Իսկ դա նշանակում է, որ դասընթացի նյութերին կարող եք ծանոթանալ (ինչպես նաև պատասխանել ինքնաստուգիչ հարցերին) Ձեզ հարմար ցանկացած ժամի և վայրում՝ դասավանդման պլանով սահմանված ճկուն ժամկետների սահմաններում:</p>

                <p>&nbsp;</p>

                <p><strong>3. Հաշվի առնվելո՞ւ են արդյոք ինքնաստուգիչ հարցերի այն պատասխանները, որոնք ներկայացվել են դասավանդման պլանով սահմանված ժամկետների խախտմամբ:</strong></p>

                <p>Ո՛չ: Հաշվի չեն առնվելու: Դասավանդման պլանով հստակ սահմանված է, որ տվյալ շաբաթվա/դասի ինքնաստուգիչ հարցերի պատասխանները պետք է ներկայացվեն մինչև տվյալ օրվա այսինչ ժամը, իսկ սահմանված ժամկետի խախտման դեպքում այդ պատասխանները հաշվի չեն առնվի և Դուք կհամարվեք տվյալ դասին չմասնակցած (4 ժամ բացակա ստացած):</p>

                <p>&nbsp;</p>

                <p><strong>4. Ինքնաստուգիչ հարցերին պատասխանելու համար բավարար կլինի՞ արդյոք մեզ տրամադրվող ուսումնական նյութը:</strong></p>

                <p>Իհարկե՝ բավարար կլինի: Կոնկրետ շաբաթվա/դասի ինքնաստուգիչ հարցերը կազմված են բացառապես այդ նույն դասի ուսումնական նյութի հիման վրա: Այսինքն՝ տվյալ շաբաթվա/դասի ուսումնական նյութին ծանոթանալով և այն յուրացնելով՝ սկզբունքորեն կարող եք ապահովել ճիշտ պատասխանների 100%-անոց արդյունք:</p>

                <p>&nbsp;</p>

                <p><strong>5. Պարտադի՞ր է արդյոք ուսումնական նյութերում տեղ գտած տեսանյութերի դիտումը:</strong></p>

                <p>Այդ տեսանյութերի դիտումը ոչ թե պարտադիր է, այլ ցանկալի, քանի որ դրանք միտված են համապատասխան շաբաթվա/դասի ուսումնական նյութն առավել հետաքրքիր, ուշագրավ և պատկերավոր դարձնելուն, ինչպես նաև դրա գործնական կարևորությունը ընդգծելուն:</p>

                <p>&nbsp;</p>

                <p><strong>6. Եթե հեռուսուցման դասընթացի ընթացքում հիվանդանում եմ կամ այլ օբյեկտիվ պատճառներով հնարավորություն չեմ ունենում պատասխանել մի քանի դասերի ինքնաստուգիչ հարցերին, ապա իրավունք ունե՞մ արդյոք պատասխանելու դրանց մինչև դասընթացի ավարտը:</strong></p>

                <p>Նման հնարավորություն նախատեսված չէ:</p>

                <p>&nbsp;</p>

                <p><strong>7. Եթե դասավանդման պլանով սահմանված ժամկետներում ունկնդիրը չի ստացել համապատասխան նյութերը, ապա նա ինչպես պետք է վարվի:</strong></p>

                <p>Թեպետ նյութերը չստանալու հավանականությունը բավականին ցածր է, սակայն դա չի կարելի սկզբունքորեն բացառված համարել: Եթե որևէ տեխնիկական խոտանի պատճառով չեք ստացել համապատասխան նյութերը, ապա.&nbsp;<br />
                կարող եք մինչև նյութերի ստացման աշխատանքային օրվա ավարտը՝ սահմանված Ձեր դասավանդման պլանով, կապ հաստատել Ակադեմիայի հեռաուսուցման վարչության աշխատակիցների հետ (նրանց հեռախոսահամարները Ձեզ նախապես տրվելու են) և տեղեկացնել առաջացած խնդրի մասին:</p>

                <p>&nbsp;</p>

                <p><strong>8. Եթե դասավանդման պլանով սահմանված ժամկետում ունկնդիրն ուղարկել է ինքնաստուգիչ հարցերի պատասխանները, ապա ինչպես վստահ լինի, որ այն հասել է հասցեատիրոջը:</strong></p>

                <p>Ինքնաստուգիչ հարցերի պատասխաններն ուղարկելուց հետո ունկնդիրն իր էլէկտրոնային փոստին կստանա համապատասխան հավաստում առ այն, որ իր ուղարկած փաստաթուղթը հասել է հասցեատիրոջը: Եթե ինչ-ինչ պատճառներով այդ հավաստումը չեք ստացել, ապա պետք է 24 ժամվա ընթացքում կապ հաստատեք Ակադեմիայի հեռաուսուցման վարչության աշխատակիցների հետ՝ ներկայացնելով խնդիրը: 24 ժամվա ընթացքում կապ չհաստատելու և խնդրի չկարգավորման դեպքում ունկնդիրը կհամարվի տվյալ դասին չմասնակցած (4 ժամ բացակա ստացած):</p>

                <p>&nbsp;</p>

                <p><strong>9. Դասավանդման պլանում նշված է, որ կան դասախոսի հետ հաղորդակցության օրեր և ժամեր: Պարտավո՞ր ենք արդյոք նշված ժամկետներում կապ հաստատել և հաղորդակցվել դասախոսի հետ:</strong></p>

                <p>Ո՛չ, պարտավոր չեք: Դասախոսի հետ հաղորդակցումը նախատեսված է ուսումնական նյութերի մասով ԲՈՎԱՆԴԱԿԱՅԻՆ բնույթի հարցերի դեպքում:</p>

                <p>&nbsp;</p>

                <p><strong>10. Կարո՞ղ եմ օգտվել ուրիշ ունկնդրի էլեկտրոնային փոստից:</strong></p>

                <p>Ո՛չ, չեք կարող: Յուրաքանչյուր ունկնդիր պարտավոր է ունենալ սեփական էլեկտրոնային փոստ:</p>',



                'text_ru' => '<p><strong>1. Ո՞րն է ինքնաստուգիչ հարցերին սխալ պատասխանելու հետևանքը:</strong></p>
                
                <p>Ունկնդիրը համարվում է դասընթացի տվյալ դասին մասնակցած, եթե պատասխանել է այդ դասի ինքնաստուգիչ հարցերին: Իսկ սա նշանակում է, որ Ձեր տված պատասխանների ճիշտ կամ սխալ լինելը որևէ կերպ չի կարող ազդել դասընթացին Ձեր մասնակցությունը որոշելու վրա:</p>
                
                <p>&nbsp;</p>
                
                <p><strong>2. Եթե ես գտնվում եմ արձակուրդում կամ գործուղման մեջ՝ ինչպե՞ս կարող եմ մասնակցել դասընթացին:</strong><br />
                Արձակուրդում կամ գործուղման մեջ գտնվելու փաստը չի խոչընդոտում Ձեր մասնակցությանը կոնկրետ դասընթացին, քանի որ վերջինս իրականացվում է առցանց: Իսկ դա նշանակում է, որ դասընթացի նյութերին կարող եք ծանոթանալ (ինչպես նաև պատասխանել ինքնաստուգիչ հարցերին) Ձեզ հարմար ցանկացած ժամի և վայրում՝ դասավանդման պլանով սահմանված ճկուն ժամկետների սահմաններում:</p>
                
                <p>&nbsp;</p>
                
                <p><strong>3. Հաշվի առնվելո՞ւ են արդյոք ինքնաստուգիչ հարցերի այն պատասխանները, որոնք ներկայացվել են դասավանդման պլանով սահմանված ժամկետների խախտմամբ:</strong></p>
                
                <p>Ո՛չ: Հաշվի չեն առնվելու: Դասավանդման պլանով հստակ սահմանված է, որ տվյալ շաբաթվա/դասի ինքնաստուգիչ հարցերի պատասխանները պետք է ներկայացվեն մինչև տվյալ օրվա այսինչ ժամը, իսկ սահմանված ժամկետի խախտման դեպքում այդ պատասխանները հաշվի չեն առնվի և Դուք կհամարվեք տվյալ դասին չմասնակցած (4 ժամ բացակա ստացած):</p>
                
                <p>&nbsp;</p>
                
                <p><strong>4. Ինքնաստուգիչ հարցերին պատասխանելու համար բավարար կլինի՞ արդյոք մեզ տրամադրվող ուսումնական նյութը:</strong></p>
                
                <p>Իհարկե՝ բավարար կլինի: Կոնկրետ շաբաթվա/դասի ինքնաստուգիչ հարցերը կազմված են բացառապես այդ նույն դասի ուսումնական նյութի հիման վրա: Այսինքն՝ տվյալ շաբաթվա/դասի ուսումնական նյութին ծանոթանալով և այն յուրացնելով՝ սկզբունքորեն կարող եք ապահովել ճիշտ պատասխանների 100%-անոց արդյունք:</p>
                
                <p>&nbsp;</p>
                
                <p><strong>5. Պարտադի՞ր է արդյոք ուսումնական նյութերում տեղ գտած տեսանյութերի դիտումը:</strong></p>
                
                <p>Այդ տեսանյութերի դիտումը ոչ թե պարտադիր է, այլ ցանկալի, քանի որ դրանք միտված են համապատասխան շաբաթվա/դասի ուսումնական նյութն առավել հետաքրքիր, ուշագրավ և պատկերավոր դարձնելուն, ինչպես նաև դրա գործնական կարևորությունը ընդգծելուն:</p>
                
                <p>&nbsp;</p>
                
                <p><strong>6. Եթե հեռուսուցման դասընթացի ընթացքում հիվանդանում եմ կամ այլ օբյեկտիվ պատճառներով հնարավորություն չեմ ունենում պատասխանել մի քանի դասերի ինքնաստուգիչ հարցերին, ապա իրավունք ունե՞մ արդյոք պատասխանելու դրանց մինչև դասընթացի ավարտը:</strong></p>
                
                <p>Նման հնարավորություն նախատեսված չէ:</p>
                
                <p>&nbsp;</p>
                
                <p><strong>7. Եթե դասավանդման պլանով սահմանված ժամկետներում ունկնդիրը չի ստացել համապատասխան նյութերը, ապա նա ինչպես պետք է վարվի:</strong></p>
                
                <p>Թեպետ նյութերը չստանալու հավանականությունը բավականին ցածր է, սակայն դա չի կարելի սկզբունքորեն բացառված համարել: Եթե որևէ տեխնիկական խոտանի պատճառով չեք ստացել համապատասխան նյութերը, ապա.&nbsp;<br />
                կարող եք մինչև նյութերի ստացման աշխատանքային օրվա ավարտը՝ սահմանված Ձեր դասավանդման պլանով, կապ հաստատել Ակադեմիայի հեռաուսուցման վարչության աշխատակիցների հետ (նրանց հեռախոսահամարները Ձեզ նախապես տրվելու են) և տեղեկացնել առաջացած խնդրի մասին:</p>
                
                <p>&nbsp;</p>
                
                <p><strong>8. Եթե դասավանդման պլանով սահմանված ժամկետում ունկնդիրն ուղարկել է ինքնաստուգիչ հարցերի պատասխանները, ապա ինչպես վստահ լինի, որ այն հասել է հասցեատիրոջը:</strong></p>
                
                <p>Ինքնաստուգիչ հարցերի պատասխաններն ուղարկելուց հետո ունկնդիրն իր էլէկտրոնային փոստին կստանա համապատասխան հավաստում առ այն, որ իր ուղարկած փաստաթուղթը հասել է հասցեատիրոջը: Եթե ինչ-ինչ պատճառներով այդ հավաստումը չեք ստացել, ապա պետք է 24 ժամվա ընթացքում կապ հաստատեք Ակադեմիայի հեռաուսուցման վարչության աշխատակիցների հետ՝ ներկայացնելով խնդիրը: 24 ժամվա ընթացքում կապ չհաստատելու և խնդրի չկարգավորման դեպքում ունկնդիրը կհամարվի տվյալ դասին չմասնակցած (4 ժամ բացակա ստացած):</p>
                
                <p>&nbsp;</p>
                
                <p><strong>9. Դասավանդման պլանում նշված է, որ կան դասախոսի հետ հաղորդակցության օրեր և ժամեր: Պարտավո՞ր ենք արդյոք նշված ժամկետներում կապ հաստատել և հաղորդակցվել դասախոսի հետ:</strong></p>
                
                <p>Ո՛չ, պարտավոր չեք: Դասախոսի հետ հաղորդակցումը նախատեսված է ուսումնական նյութերի մասով ԲՈՎԱՆԴԱԿԱՅԻՆ բնույթի հարցերի դեպքում:</p>
                
                <p>&nbsp;</p>
                
                <p><strong>10. Կարո՞ղ եմ օգտվել ուրիշ ունկնդրի էլեկտրոնային փոստից:</strong></p>
                
                <p>Ո՛չ, չեք կարող: Յուրաքանչյուր ունկնդիր պարտավոր է ունենալ սեփական էլեկտրոնային փոստ:</p>',
            ],
        ]);
    }
}
